Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector Constructor
 Initializes a new instance of the AnalysisObjectSelector class.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectSelector()
Public Sub New
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis.UI Namespace